In [1]:
# import libraries
import pandas as pd

In [2]:
# install the ipython-sql library
!pip install ipython-sql
!pip3 install mysqlclient

Installing collected packages: typing-extensions, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-2.0.2 ipython-sql-0.5.0 prettytable-3.7.0 sqlalchemy-2.0.11 sqlparse-0.4.4 typing-extensions-4.5.0

Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.1

In [3]:
# load the SQL modules
%load_ext sql

In [4]:
%sql mysql://root:******@localhost/ig_clone

 # Answer the following questions:

## 1. We want to reward the user who has been around the longest, Find the 5 oldest users.

In [5]:
%%sql
select * from users order by  created_at asc limit 5;

 * mysql://root:***@localhost/ig_clone
5 rows affected.

[(80, 'Darby_Herzog', datetime.datetime(2016, 5, 6, 0, 14, 21)),
 (67, 'Emilio_Bernier52', datetime.datetime(2016, 5, 6, 13, 4, 30)),
 (63, 'Elenor88', datetime.datetime(2016, 5, 8, 1, 30, 41)),
 (95, 'Nicole71', datetime.datetime(2016, 5, 9, 17, 30, 22)),
 (38, 'Jordyn.Jacobson2', datetime.datetime(2016, 5, 14, 7, 56, 26))]

## 2. To understand when to run the ad campaign, figure out the day of the week most users register on?

In [20]:
%%sql
select (select dayname(created_at)) as week_day,count(id) as Total_register_users 
from users 
group by week_day 
order by Total_register_users desc limit 2;

 * mysql://root:***@localhost/ig_clone
2 rows affected.

[('Thursday', 16), ('Sunday', 16)]

## 3. To target inactive users in an email ad campaign, find the users who have never posted a photo

In [22]:
%%sql
select * from users where id NOT IN (select user_id from photos ) ;
select * from users u left join photos p on u.id=p.user_id where p.user_id is null;
select * from users  u where  not exists (select * from photos p where u.id=p.user_id);
select * from users u where 0= (select count(*) from photos p where u.id=p.user_id);

 * mysql://root:***@localhost/ig_clone
26 rows affected.
26 rows affected.
26 rows affected.
26 rows affected.

[(5, 'Aniya_Hackett', datetime.datetime(2016, 12, 7, 1, 4, 39)),
 (7, 'Kasandra_Homenick', datetime.datetime(2016, 12, 12, 6, 50, 8)),
 (14, 'Jaclyn81', datetime.datetime(2017, 2, 6, 23, 29, 16)),
 (21, 'Rocio33', datetime.datetime(2017, 1, 23, 11, 51, 15)),
 (24, 'Maxwell.Halvorson', datetime.datetime(2017, 4, 18, 2, 32, 44)),
 (25, 'Tierra.Trantow', datetime.datetime(2016, 10, 3, 12, 49, 21)),
 (34, 'Pearl7', datetime.datetime(2016, 7, 8, 21, 42, 1)),
 (36, 'Ollie_Ledner37', datetime.datetime(2016, 8, 4, 15, 42, 20)),
 (41, 'Mckenna17', datetime.datetime(2016, 7, 17, 17, 25, 45)),
 (45, 'David.Osinski47', datetime.datetime(2017, 2, 5, 21, 23, 37)),
 (49, 'Morgan.Kassulke', datetime.datetime(2016, 10, 30, 12, 42, 31)),
 (53, 'Linnea59', datetime.datetime(2017, 2, 7, 7, 49, 34)),
 (54, 'Duane60', datetime.datetime(2016, 12, 21, 4, 43, 38)),
 (57, 'Julien_Schmidt', datetime.datetime(2017, 2, 2, 23, 12, 48)),
 (66, 'Mike.Auer39', datetime.datetime(2016, 7, 1, 17, 36, 15)),
 (68, 'Franco_Keebler64', datetime.datetime(2016, 11, 13, 20, 9, 27)),
 (71, 'Nia_Haag', datetime.datetime(2016, 5, 14, 15, 38, 50)),
 (74, 'Hulda.Macejkovic', datetime.datetime(2017, 1, 25, 17, 17, 28)),
 (75, 'Leslie67', datetime.datetime(2016, 9, 21, 5, 14, 1)),
 (76, 'Janelle.Nikolaus81', datetime.datetime(2016, 7, 21, 9, 26, 9)),
 (80, 'Darby_Herzog', datetime.datetime(2016, 5, 6, 0, 14, 21)),
 (81, 'Esther.Zulauf61', datetime.datetime(2017, 1, 14, 17, 2, 34)),
 (83, 'Bartholome.Bernhard', datetime.datetime(2016, 11, 6, 2, 31, 23)),
 (89, 'Jessyca_West', datetime.datetime(2016, 9, 14, 23, 47, 5)),
 (90, 'Esmeralda.Mraz57', datetime.datetime(2017, 3, 3, 11, 52, 27)),
 (91, 'Bethany20', datetime.datetime(2016, 6, 3, 23, 31, 53))]

## 4. Suppose you are running a contest to find out who got the most likes on a photo. Find out who won?

In [23]:
%%sql
select * from users u inner join photos p on p.user_id=u.id where p.id =
(select photo_id from likes 
group by photo_id order by count(user_id)desc limit 1);

 * mysql://root:***@localhost/ig_clone
1 rows affected.

[(52, 'Zack_Kemmer93', datetime.datetime(2017, 1, 1, 5, 58, 22), 145, 'https://jarret.name', 52, datetime.datetime(2023, 4, 11, 22, 44, 41))]

## 5.The investors want to know how many times does the average user post.

In [26]:
%%sql
select round(avg(post_table.post)) as average_user_post 
from (select count(id) as post  from photos p group by p.user_id) as post_table;

 * mysql://root:***@localhost/ig_clone
1 rows affected.

[(Decimal('3'),)]

In [27]:
%%sql
drop temporary  table if exists post;
create temporary table post select count(id) as number_of_post from photos group by user_id;
select round(avg(number_of_post)) as average_user_post from post;

 * mysql://root:***@localhost/ig_clone
0 rows affected.
74 rows affected.
1 rows affected.

[(Decimal('3'),)]

## 6. A brand wants to know which hashtag to use on a post, and find the top 5 most used hashtags.

In [30]:
%%sql
select  distinct(tag_name) from tags t inner join photo_tags pt on pt.tag_id=t.id
inner join photos p on p.id=pt.photo_id group by tag_name ;

 * mysql://root:***@localhost/ig_clone
21 rows affected.

[('beach',),
 ('beauty',),
 ('concert',),
 ('delicious',),
 ('dreamy',),
 ('drunk',),
 ('fashion',),
 ('food',),
 ('foodie',),
 ('fun',),
 ('hair',),
 ('happy',),
 ('landscape',),
 ('lol',),
 ('party',),
 ('photography',),
 ('smile',),
 ('stunning',),
 ('style',),
 ('sunrise',),
 ('sunset',)]

In [33]:
%%sql
select  t.tag_name,count(p.id) as no_of_photos from tags t inner join photo_tags pt on pt.tag_id=t.id
inner join photos p on p.id=pt.photo_id 
group by tag_name order by no_of_photos desc limit 5 ;

 * mysql://root:***@localhost/ig_clone
5 rows affected.

[('smile', 59), ('beach', 42), ('party', 39), ('fun', 38), ('concert', 24)]

## 7. To find out if there are bots, find users who have liked every single photo on the site.

In [34]:
%%sql
select * from users 
 where id in (select user_id from likes
  group by user_id having count(photo_id) =(select count(id) from photos))

 * mysql://root:***@localhost/ig_clone
13 rows affected.

[(5, 'Aniya_Hackett', datetime.datetime(2016, 12, 7, 1, 4, 39)),
 (14, 'Jaclyn81', datetime.datetime(2017, 2, 6, 23, 29, 16)),
 (21, 'Rocio33', datetime.datetime(2017, 1, 23, 11, 51, 15)),
 (24, 'Maxwell.Halvorson', datetime.datetime(2017, 4, 18, 2, 32, 44)),
 (36, 'Ollie_Ledner37', datetime.datetime(2016, 8, 4, 15, 42, 20)),
 (41, 'Mckenna17', datetime.datetime(2016, 7, 17, 17, 25, 45)),
 (54, 'Duane60', datetime.datetime(2016, 12, 21, 4, 43, 38)),
 (57, 'Julien_Schmidt', datetime.datetime(2017, 2, 2, 23, 12, 48)),
 (66, 'Mike.Auer39', datetime.datetime(2016, 7, 1, 17, 36, 15)),
 (71, 'Nia_Haag', datetime.datetime(2016, 5, 14, 15, 38, 50)),
 (75, 'Leslie67', datetime.datetime(2016, 9, 21, 5, 14, 1)),
 (76, 'Janelle.Nikolaus81', datetime.datetime(2016, 7, 21, 9, 26, 9)),
 (91, 'Bethany20', datetime.datetime(2016, 6, 3, 23, 31, 53))]

In [35]:
%%sql
select u.id,u.username,count(photo_id) as photo_likes from users u 
inner join likes l on l.user_id=u.id group by u.id having count(photo_id)=(select count(id) from photos);

 * mysql://root:***@localhost/ig_clone
13 rows affected.

[(5, 'Aniya_Hackett', 257),
 (14, 'Jaclyn81', 257),
 (21, 'Rocio33', 257),
 (24, 'Maxwell.Halvorson', 257),
 (36, 'Ollie_Ledner37', 257),
 (41, 'Mckenna17', 257),
 (54, 'Duane60', 257),
 (57, 'Julien_Schmidt', 257),
 (66, 'Mike.Auer39', 257),
 (71, 'Nia_Haag', 257),
 (75, 'Leslie67', 257),
 (76, 'Janelle.Nikolaus81', 257),
 (91, 'Bethany20', 257)]

## 8. To know who the celebrities are, find users who have never commented on a photo

In [36]:
%%sql
select * from users where id not in (select user_id from comments);
select * from users u left join comments c on c.user_id=u.id where c.user_id is null;
select * from users u where  not exists  (select c.user_id from comments c where u.id=c.user_id);
select * from users u where 0= (select count(*) from comments c where u.id=c.user_id);

 * mysql://root:***@localhost/ig_clone
23 rows affected.
23 rows affected.
23 rows affected.
23 rows affected.

[(1, 'Kenton_Kirlin', datetime.datetime(2017, 2, 16, 18, 22, 11)),
 (7, 'Kasandra_Homenick', datetime.datetime(2016, 12, 12, 6, 50, 8)),
 (23, 'Eveline95', datetime.datetime(2017, 1, 23, 23, 14, 19)),
 (25, 'Tierra.Trantow', datetime.datetime(2016, 10, 3, 12, 49, 21)),
 (29, 'Jaime53', datetime.datetime(2016, 9, 11, 18, 51, 57)),
 (34, 'Pearl7', datetime.datetime(2016, 7, 8, 21, 42, 1)),
 (45, 'David.Osinski47', datetime.datetime(2017, 2, 5, 21, 23, 37)),
 (49, 'Morgan.Kassulke', datetime.datetime(2016, 10, 30, 12, 42, 31)),
 (51, 'Mariano_Koch3', datetime.datetime(2017, 4, 17, 14, 14, 46)),
 (53, 'Linnea59', datetime.datetime(2017, 2, 7, 7, 49, 34)),
 (58, 'Aurelie71', datetime.datetime(2016, 5, 31, 6, 20, 57)),
 (59, 'Cesar93', datetime.datetime(2016, 10, 18, 16, 42, 43)),
 (64, 'Florence99', datetime.datetime(2016, 10, 6, 23, 8, 31)),
 (68, 'Franco_Keebler64', datetime.datetime(2016, 11, 13, 20, 9, 27)),
 (74, 'Hulda.Macejkovic', datetime.datetime(2017, 1, 25, 17, 17, 28)),
 (77, 'Donald.Fritsch', datetime.datetime(2017, 1, 7, 10, 5, 41)),
 (80, 'Darby_Herzog', datetime.datetime(2016, 5, 6, 0, 14, 21)),
 (81, 'Esther.Zulauf61', datetime.datetime(2017, 1, 14, 17, 2, 34)),
 (83, 'Bartholome.Bernhard', datetime.datetime(2016, 11, 6, 2, 31, 23)),
 (86, 'Delfina_VonRueden68', datetime.datetime(2017, 3, 21, 12, 2, 14)),
 (88, 'Clint27', datetime.datetime(2016, 6, 2, 21, 40, 10)),
 (89, 'Jessyca_West', datetime.datetime(2016, 9, 14, 23, 47, 5)),
 (90, 'Esmeralda.Mraz57', datetime.datetime(2017, 3, 3, 11, 52, 27))]

## 9. Now it's time to find both of them together, find the users who have never commented on any photo or have commented on every photo

In [37]:
%%sql
with cte1 as 
(
select * from users where id not in (select user_id from comments)
),
cte2 as 
(
select * from users where id  in (select user_id from comments 
group by user_id having count(photo_id)=(select count(id) from photos))
)
select * from cte1 union select * from cte2;

 * mysql://root:***@localhost/ig_clone
36 rows affected.

[(1, 'Kenton_Kirlin', datetime.datetime(2017, 2, 16, 18, 22, 11)),
 (7, 'Kasandra_Homenick', datetime.datetime(2016, 12, 12, 6, 50, 8)),
 (23, 'Eveline95', datetime.datetime(2017, 1, 23, 23, 14, 19)),
 (25, 'Tierra.Trantow', datetime.datetime(2016, 10, 3, 12, 49, 21)),
 (29, 'Jaime53', datetime.datetime(2016, 9, 11, 18, 51, 57)),
 (34, 'Pearl7', datetime.datetime(2016, 7, 8, 21, 42, 1)),
 (45, 'David.Osinski47', datetime.datetime(2017, 2, 5, 21, 23, 37)),
 (49, 'Morgan.Kassulke', datetime.datetime(2016, 10, 30, 12, 42, 31)),
 (51, 'Mariano_Koch3', datetime.datetime(2017, 4, 17, 14, 14, 46)),
 (53, 'Linnea59', datetime.datetime(2017, 2, 7, 7, 49, 34)),
 (58, 'Aurelie71', datetime.datetime(2016, 5, 31, 6, 20, 57)),
 (59, 'Cesar93', datetime.datetime(2016, 10, 18, 16, 42, 43)),
 (64, 'Florence99', datetime.datetime(2016, 10, 6, 23, 8, 31)),
 (68, 'Franco_Keebler64', datetime.datetime(2016, 11, 13, 20, 9, 27)),
 (74, 'Hulda.Macejkovic', datetime.datetime(2017, 1, 25, 17, 17, 28)),
 (77, 'Donald.Fritsch', datetime.datetime(2017, 1, 7, 10, 5, 41)),
 (80, 'Darby_Herzog', datetime.datetime(2016, 5, 6, 0, 14, 21)),
 (81, 'Esther.Zulauf61', datetime.datetime(2017, 1, 14, 17, 2, 34)),
 (83, 'Bartholome.Bernhard', datetime.datetime(2016, 11, 6, 2, 31, 23)),
 (86, 'Delfina_VonRueden68', datetime.datetime(2017, 3, 21, 12, 2, 14)),
 (88, 'Clint27', datetime.datetime(2016, 6, 2, 21, 40, 10)),
 (89, 'Jessyca_West', datetime.datetime(2016, 9, 14, 23, 47, 5)),
 (90, 'Esmeralda.Mraz57', datetime.datetime(2017, 3, 3, 11, 52, 27)),
 (5, 'Aniya_Hackett', datetime.datetime(2016, 12, 7, 1, 4, 39)),
 (14, 'Jaclyn81', datetime.datetime(2017, 2, 6, 23, 29, 16)),
 (21, 'Rocio33', datetime.datetime(2017, 1, 23, 11, 51, 15)),
 (24, 'Maxwell.Halvorson', datetime.datetime(2017, 4, 18, 2, 32, 44)),
 (36, 'Ollie_Ledner37', datetime.datetime(2016, 8, 4, 15, 42, 20)),
 (41, 'Mckenna17', datetime.datetime(2016, 7, 17, 17, 25, 45)),
 (54, 'Duane60', datetime.datetime(2016, 12, 21, 4, 43, 38)),
 (57, 'Julien_Schmidt', datetime.datetime(2017, 2, 2, 23, 12, 48)),
 (66, 'Mike.Auer39', datetime.datetime(2016, 7, 1, 17, 36, 15)),
 (71, 'Nia_Haag', datetime.datetime(2016, 5, 14, 15, 38, 50)),
 (75, 'Leslie67', datetime.datetime(2016, 9, 21, 5, 14, 1)),
 (76, 'Janelle.Nikolaus81', datetime.datetime(2016, 7, 21, 9, 26, 9)),
 (91, 'Bethany20', datetime.datetime(2016, 6, 3, 23, 31, 53))]